In [14]:
import numpy as np
import pandas as pd
data={
    'name':['adhi','biju','unni','ravi'],
    'age':[22,20,21,20],
    'salary':[2000,3000,2300,2500],
    'city':['kannur','kochi','kochi','kollam']
}
df=pd.DataFrame(data)

df

   name  age  salary    city
0  adhi   22    2000  kannur
1  biju   20    3000   kochi
2  unni   21    2300   kochi
3  ravi   20    2500  kollam

In [12]:
#pipe
result=(
    df[df['salary']>2000]
    .sort_values(by='age')
    .reset_index(drop=True)
    [['name','age','salary','city']]
)
result

   name  age  salary    city
0  biju   20    3000   kochi
1  ravi   20    2500  kollam
2  unni   21    2300   kochi

In [19]:

#apply
df.salary.apply(np.sqrt)

0    44.721360
1    54.772256
2    47.958315
3    50.000000
Name: salary, dtype: float64

In [24]:
df.age.apply(np.sum)

0    22
1    20
2    21
3    20
Name: age, dtype: int32

In [29]:
#apply map
df.applymap(lambda x:len(str(x)))

C:\Users\Python\AppData\Local\Temp\ipykernel_7688\1974167272.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x:len(str(x)))

   name  age  salary  city
0     4    2       4     6
1     4    2       4     5
2     4    2       4     5
3     4    2       4     6